{
  "backend/main.mo": "Actor storing click counts in a map with methods to record clicks and query counts individually or all at once.",
  "feature_evidence.json": "Feature evidence report linking product requirements to affected frontend files and components.",
  "frontend-file-summaries.txt": "List of brief summaries describing the purpose of various frontend files across the project.",
  "frontend/index.css": "Tailwind base layer defining CSS variables for light/dark themes and applying global background, text, and border styles.",
  "frontend/index.html": "Main HTML entry with PWA metadata, icons, social meta tags, and root div for the React app.",
  "frontend/public/manifest.webmanifest": "PWA manifest specifying app metadata, theme colors, start behavior, and icons.",
  "frontend/public/offline.html": "Styled offline fallback page with auto-reload logic and connection checks.",
  "frontend/public/sw.js": "Service worker implementing precaching, cache cleanup, and offline-first fetch handling with an offline fallback.",
  "frontend/src/App.tsx": "Main React component composing all site sections, handling navigation scroll logic, and registering the service worker.",
  "frontend/src/components/BoostlyLink.tsx": "Component displaying the site's URL with a copy-to-clipboard button and temporary success state.",
  "frontend/src/components/Footer.tsx": "Renders a multi-column footer with brand info, resource links, social icons, and a copyright note.",
  "frontend/src/components/HeroSection.tsx": "Displays a hero banner with growth messaging, action buttons, and a featured image.",
  "frontend/src/components/Layout.tsx": "Provides a simple page layout wrapper with vertical flex structure.",
  "frontend/src/components/MarketingNav.tsx": "Implements a responsive navigation bar with scroll effects, search, and mobile drawer menu.",
  "frontend/src/components/sections/BroadTopicGuidanceSection.tsx": "Shows guidance cards for broad content topics with tips, categories, and optional disclaimers.",
  "frontend/src/components/sections/ContentTypeGuidanceSection.tsx": "Displays cards detailing different content types with descriptions, tips, and disclaimers.",
  "frontend/src/components/sections/CoreGrowthTipsSection.tsx": "Renders a section displaying core growth tips and actionable checklists using cards populated from growthTips and checklists data.",
  "frontend/src/components/sections/FaqSection.tsx": "Displays a FAQ section with collapsible accordion items sourced from the faqs content array.",
  "frontend/src/components/sections/GetBoostlyAppSection.tsx": "Provides installation prompts and instructions for the Boostly PWA, adapting UI based on installability and installation state.",
  "frontend/src/components/sections/PaymentMonetizationSection.tsx": "Shows Cash App monetization info, tracks click counts, and provides a payment link card with setup alerts if unconfigured.",
  "frontend/src/components/sections/PlatformTipsSection.tsx": "Displays platform-specific growth tips using tabbed navigation with icons and cards populated from platformTips data.",
  "frontend/src/components/sections/SubscriptionPricingSection.tsx": "Renders subscription plan options, tracks plan click counts, and opens configured subscription links for monthly or annual plans.",
  "frontend/src/components/sections/ToolsResourcesSection.tsx": "Renders a resources section displaying categorized tool cards with icons and external links. Uses a forwardRef and maps categories into UI cards.",
  "frontend/src/components/SiteSearch.tsx": "Provides an interactive search bar with live results, keyboard navigation, and result selection.",
  "frontend/src/config/cashAppLinks.ts": "Exports a configurable Cash App payment URL placeholder for external payment redirection.",
  "frontend/src/config/subscriptionLinks.ts": "Defines and exports Stripe checkout URLs for monthly and annual subscription plans.",
  "frontend/src/content/broadTopicGuidance.ts": "Exports structured guidance items for broad content topics, including mental health, learning, and collaboration, with tips and metadata.",
  "frontend/src/content/contentTypeGuidance.ts": "Provides definitions and arrays of content-type guidance items, each with tips, keywords, and optional disclaimers.",
  "frontend/src/content/growthGuidance.ts": "Contains growth tips and checklists for social media strategy, covering optimization, consistency, engagement, and analytics.",
  "frontend/src/content/siteContent.ts": "Centralized platform-specific tips and FAQs for search indexing, covering Instagram, TikTok, YouTube, LinkedIn, X, and more.",
  "frontend/src/hooks/useActor.ts": "React hook that creates and manages a backend actor based on Internet Identity, refetching dependent queries when identity changes.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides a React context and provider for managing Internet Identity login, state, and persisted identities using AuthClient.",
  "frontend/src/hooks/usePaymentClickCounts.ts": "Fetches and updates backend-stored payment button click counts using react-query and actor calls.",
  "frontend/src/hooks/usePwaInstall.ts": "Tracks PWA installability, handles beforeinstallprompt events, and exposes an install trigger.",
  "frontend/src/hooks/useQueries.ts": "Placeholder hook exposing actor and loading state for future backend queries.",
  "frontend/src/index.css": "Tailwind CSS setup defining theme variables, typography, dark mode, utilities, and UI animations.",
  "frontend/src/main.tsx": "App entry point initializing React, react-query, and Internet Identity provider.",
  "frontend/src/pwa/registerServiceWorker.ts": "Registers a service worker on page load if supported.",
  "frontend/src/search/scrollAndHighlight.ts": "Scrolls to an element smoothly and applies a temporary highlight effect for search navigation.",
  "frontend/src/search/searchIndex.ts": "Builds and queries a searchable index of site content with tokenization and scoring logic.",
  "frontend/tailwind.config.js": "Tailwind configuration enabling themes, custom colors, animations, fonts, and plugins.",
  "project_state.json": "Defines the current Boostly project state, including app goals, search and content taxonomy plans, and monetization decisions. Lists existing features, architectural notes, and versioning info for ongoing development."
}