{
  "backend/main.mo": "Actor storing per-button click counts with functions to record clicks and query counts.",
  "feature_evidence.json": "Feature evidence metadata mapping a subscription-link update feature to related files, components, and tests.",
  "frontend-file-summaries.txt": "List of short summaries describing various frontend files and components in the project.",
  "frontend/index.css": "Tailwind base layer defining CSS variables for light/dark themes and applying global background and text styles.",
  "frontend/index.html": "Main HTML entry with meta tags, PWA setup, icons, and root mount element.",
  "frontend/public/manifest.webmanifest": "PWA manifest declaring app metadata, colors, start URL, and icon assets.",
  "frontend/public/offline.html": "Offline fallback page with simple styling, reload button, and auto-reconnect logic.",
  "frontend/public/sw.js": "Service worker implementing precaching, cache cleanup, and network‑fallback behavior with offline support.",
  "frontend/src/App.tsx": "Main React app assembling all sections, navigation, search handling, and service worker registration.",
  "frontend/src/components/BoostlyLink.tsx": "Component showing the site URL with copy‑to‑clipboard functionality and success feedback.",
  "frontend/src/components/Footer.tsx": "Renders a site footer with brand info, resource links, social icons, and a dynamic copyright line.",
  "frontend/src/components/HeroSection.tsx": "Displays a hero banner with growth messaging, CTA buttons, and a promotional image.",
  "frontend/src/components/Layout.tsx": "Simple layout wrapper providing a full-height flex column container for page content.",
  "frontend/src/components/MarketingNav.tsx": "Implements a responsive navigation bar with scroll behavior, search, and mobile drawer menu.",
  "frontend/src/components/sections/BroadTopicGuidanceSection.tsx": "Renders cards with guidance, disclaimers, and tips for broad content topics using provided data.",
  "frontend/src/components/sections/ContentTypeGuidanceSection.tsx": "Shows cards detailing different content types with descriptions, optional disclaimers, and tips.",
  "frontend/src/components/sections/CoreGrowthTipsSection.tsx": "Renders a section showing core growth tips and actionable checklists using cards, icons, and mapped content arrays.",
  "frontend/src/components/sections/FaqSection.tsx": "Displays a FAQ section with an accordion that lists questions and answers from provided content.",
  "frontend/src/components/sections/GetBoostlyAppSection.tsx": "Provides PWA installation options, installation status messages, and platform-specific app install instructions.",
  "frontend/src/components/sections/PaymentMonetizationSection.tsx": "Shows monetization options for Apple Pay and Cash App, tracks click counts, and opens external payment links.",
  "frontend/src/components/sections/PlatformTipsSection.tsx": "Displays platform-specific growth tips using a tabbed UI with icons and mapped tip lists.",
  "frontend/src/components/sections/SubscriptionPricingSection.tsx": "Presents monthly and annual subscription plans, tracks subscription link clicks, and handles external checkout navigation.",
  "frontend/src/components/sections/ToolsResourcesSection.tsx": "Renders a resources section with categorized tool lists using cards and icons, mapping predefined categories into UI elements.",
  "frontend/src/components/SiteSearch.tsx": "Provides a searchable dropdown component with keyboard navigation, result handling, and clearing.",
  "frontend/src/config/subscriptionLinks.ts": "Exports monthly and annual Stripe checkout URLs for subscriptions.",
  "frontend/src/content/broadTopicGuidance.ts": "Defines guidance items for broad content topics with metadata, disclaimers, keywords, and detailed tips.",
  "frontend/src/content/contentTypeGuidance.ts": "Provides structured guidance for different content types including categories, keywords, and tip lists.",
  "frontend/src/content/growthGuidance.ts": "Exports growth tips and checklists for social media improvement, each with descriptions and actionable points.",
  "frontend/src/content/siteContent.ts": "Centralizes platform-specific tips and FAQs for search indexing, covering major social platforms.",
  "frontend/src/hooks/useActor.ts": "React hook that creates and manages an authenticated or anonymous backend actor, refetching queries when identity changes.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides a React context and provider for managing Internet Identity authentication using AuthClient, exposing identity, login, logout, and status helpers.",
  "frontend/src/hooks/usePaymentClickCounts.ts": "Tracks and mutates payment button click counts via backend actor calls using React Query.",
  "frontend/src/hooks/usePwaInstall.ts": "Manages PWA installation prompts, tracking installability, installation state, and triggering the install flow.",
  "frontend/src/hooks/useQueries.ts": "Exposes backend actor and loading state as a placeholder for additional backend queries.",
  "frontend/src/index.css": "Defines Tailwind base styles, theme variables, dark mode colors, typography, and utility classes including highlight animations.",
  "frontend/src/main.tsx": "Bootstraps the React app with QueryClient and InternetIdentity providers.",
  "frontend/src/pwa/registerServiceWorker.ts": "Registers the service worker on window load and logs registration results.",
  "frontend/src/search/scrollAndHighlight.ts": "Scrolls to a target element and applies a temporary highlight and focus effect.",
  "frontend/src/search/searchIndex.ts": "Builds a unified search index from content sources and provides tokenized relevance-based search.",
  "frontend/tailwind.config.js": "Configures Tailwind theme extensions, colors, fonts, utilities, and plugins for the project.",
  "project_state.json": "Describes the Boostly project's current state, including goals for a social‑media growth site, app integration, and monetization. Lists architectural notes, existing features, and versioned project metadata."
}