{
  "backend/main.mo": "Motoko actor storing click counts in a map with functions to record clicks and query individual or all counts.",
  "feature_evidence.json": "JSON report listing implemented PWA splash screen, iOS startup image tags, and service worker precache features with related metadata.",
  "frontend-file-summaries.txt": "Prewritten summaries describing the purpose of various frontend source files.",
  "frontend/index.css": "Tailwind base styling and CSS variables defining light and dark theme color systems and global element rules.",
  "frontend/index.html": "Main HTML entry with PWA meta tags, icons, manifest, and iOS splash screen startup-image links.",
  "frontend/public/manifest.webmanifest": "PWA manifest specifying app metadata, colors, icons, and display settings.",
  "frontend/public/offline.html": "Standalone offline fallback page with styled layout and auto-reload logic when connection returns.",
  "frontend/public/sw.js": "Service worker caching shell assets, splash images, and offline page using cache-first and navigation fallback strategies.",
  "frontend/src/App.tsx": "Main React app assembling all sections, navigation scroll logic, search integration, and service worker registration.",
  "frontend/src/components/BoostlyLink.tsx": "Displays the current site URL with a button to copy it to the clipboard, showing temporary feedback when copied.",
  "frontend/src/components/Footer.tsx": "Renders the site footer with branding, navigation links, social icons, and copyright info.",
  "frontend/src/components/HeroSection.tsx": "Hero section with marketing text, action buttons, an illustration, and an embedded BoostlyLink component.",
  "frontend/src/components/Layout.tsx": "Simple layout wrapper providing a full-height flex container around child content.",
  "frontend/src/components/MarketingNav.tsx": "Responsive navigation bar with search, scroll-based styling, and mobile sheet menu for navigating site sections.",
  "frontend/src/components/sections/BroadTopicGuidanceSection.tsx": "Section that lists broad content guidance topics as cards with icons, descriptions, disclaimers, and tips.",
  "frontend/src/components/sections/ContentTypeGuidanceSection.tsx": "Displays content-type guidance cards with category badges, descriptions, optional disclaimers, and tip lists.",
  "frontend/src/components/sections/CoreGrowthTipsSection.tsx": "Renders growth tips and checklists using cards, icons, and mapped content data.",
  "frontend/src/components/sections/FaqSection.tsx": "Displays FAQ items in an accordion using mapped site content.",
  "frontend/src/components/sections/GetBoostlyAppSection.tsx": "Shows PWA install options, status messages, and a callout for video lessons.",
  "frontend/src/components/sections/PaymentMonetizationSection.tsx": "Provides Cash App monetization UI with click tracking, alerts, and payment link handling.",
  "frontend/src/components/sections/PlatformTipsSection.tsx": "Shows platform-specific growth tips with icon tabs and detailed card content.",
  "frontend/src/components/sections/SubscriptionPricingSection.tsx": "Displays subscription plans with selectable options, features, and click-tracked payment links.",
  "frontend/src/components/sections/ToolsResourcesSection.tsx": "Renders a resources section with categorized tool lists and icons using cards and badges.",
  "frontend/src/components/sections/VideoLessonsSection.tsx": "Displays video lesson cards with platform-specific styling, tags, and watch functionality.",
  "frontend/src/components/SiteSearch.tsx": "Search input with autocomplete results, keyboard navigation, and callbacks for selecting items.",
  "frontend/src/config/cashAppLinks.ts": "Exports the configured Cash App payment URL for linking to payment pages.",
  "frontend/src/config/paymentContactNote.ts": "Defines a post‑payment contact note configuration with message, link, and a helper to check if it’s set.",
  "frontend/src/config/subscriptionLinks.ts": "Maps monthly and annual subscription links to the Cash App payment URL.",
  "frontend/src/content/broadTopicGuidance.ts": "Provides structured guidance items for broad content topics with tips, keywords, and optional disclaimers.",
  "frontend/src/content/contentTypeGuidance.ts": "Contains guidance items for specific content types including descriptions, tips, keywords, and optional disclaimers.",
  "frontend/src/content/growthGuidance.ts": "Exports growth tips and checklists covering profile optimization, content strategy, consistency, engagement, and analytics.",
  "frontend/src/content/siteContent.ts": "Defines interfaces and static tip/FAQ content for multiple social platforms, used for search indexing and UI display.",
  "frontend/src/content/videoLessons.ts": "Provides a typed list of video lesson metadata including titles, descriptions, tags, and optional URLs.",
  "frontend/src/hooks/useActor.ts": "Creates and manages a backend actor tied to Internet Identity, refreshing dependent queries when the identity changes.",
  "frontend/src/hooks/useInternetIdentity.ts": "Implements an authentication context using Internet Identity, handling login, session loading, and identity state.",
  "frontend/src/hooks/usePaymentClickCounts.ts": "Fetches and updates payment button click counts via the backend actor using React Query.",
  "frontend/src/hooks/usePwaInstall.ts": "Manages PWA install prompts, tracking installability and triggering the install flow.",
  "frontend/src/hooks/useQueries.ts": "Simple wrapper exposing the backend actor and fetch state for future backend queries.",
  "frontend/src/index.css": "Tailwind-based global styles defining color themes, typography, utility classes, and animations.",
  "frontend/src/main.tsx": "Bootstraps the React app, initializing QueryClient and the Internet Identity provider.",
  "frontend/src/pwa/registerServiceWorker.ts": "Registers the service worker on page load for PWA support.",
  "frontend/src/search/scrollAndHighlight.ts": "Provides smooth scrolling to an element and applies a temporary highlight effect for search navigation.",
  "frontend/src/search/searchIndex.ts": "Builds a unified search index from various content types and provides functions to tokenize text and return matches for user queries.",
  "frontend/tailwind.config.js": "Configures Tailwind with custom colors, typography, container settings, animations, and extended theme utilities.",
  "project_state.json": "Stores the project’s state, goals, architectural notes, image requirements, and existing features for the Boostly app and website."
}