{
  "backend/main.mo": "Actor storing click counts in a map with endpoints to record clicks and retrieve counts individually or as an array.",
  "feature_evidence.json": "Feature evidence report describing required updates to videoLessons.ts using user-provided YouTube URLs.",
  "frontend-file-summaries.txt": "Prewritten summaries of multiple frontend files for reference in build planning.",
  "frontend/index.css": "Tailwind base styles defining CSS variables for light and dark themes and applying global background and text settings.",
  "frontend/index.html": "Main HTML entry point with PWA meta tags, manifest link, icons, and root element for mounting the app.",
  "frontend/public/manifest.webmanifest": "PWA manifest defining app metadata, icons, colors, and startup behavior.",
  "frontend/public/offline.html": "Offline fallback page with simple branding, retry button, and auto-reconnect logic.",
  "frontend/public/sw.js": "Service worker handling precaching, cache cleanup, fetch interception, and offline fallback routing.",
  "frontend/src/App.tsx": "Main React app wiring section navigation, search index, service worker registration, and layout composition.",
  "frontend/src/components/BoostlyLink.tsx": "Component displaying the site URL with a copy-to-clipboard button and temporary success feedback.",
  "frontend/src/components/Footer.tsx": "Renders the site footer with brand info, resource links, social icons, and a dynamic copyright year.",
  "frontend/src/components/HeroSection.tsx": "Displays a hero section with growth messaging, call‑to‑action buttons, and a featured illustration.",
  "frontend/src/components/Layout.tsx": "Provides a simple page layout wrapper with a full‑height flex column container.",
  "frontend/src/components/MarketingNav.tsx": "Implements a responsive marketing navigation bar with search, scroll effects, and mobile sheet menu.",
  "frontend/src/components/sections/BroadTopicGuidanceSection.tsx": "Renders cards containing broad topic guidance with badges, tips, and optional disclaimers.",
  "frontend/src/components/sections/ContentTypeGuidanceSection.tsx": "Displays content type guidance cards including descriptions, tips, and category badges.",
  "frontend/src/components/sections/CoreGrowthTipsSection.tsx": "Renders core growth tips and actionable checklists using cards, pulling data from growthTips and checklists content sources.",
  "frontend/src/components/sections/FaqSection.tsx": "Displays a FAQ list using an accordion UI fed by the faqs content array.",
  "frontend/src/components/sections/GetBoostlyAppSection.tsx": "Provides PWA install prompts and post-install callouts, using usePwaInstall for state handling.",
  "frontend/src/components/sections/PaymentMonetizationSection.tsx": "Shows Cash App monetization info, tracks click counts, and conditionally displays setup alerts and payment buttons.",
  "frontend/src/components/sections/PlatformTipsSection.tsx": "Offers platform-specific growth tips via a tabbed interface populated from platformTips.",
  "frontend/src/components/sections/SubscriptionPricingSection.tsx": "Implements subscription plan selection, feature lists, and tracked outbound subscription links using click counts.",
  "frontend/src/components/sections/ToolsResourcesSection.tsx": "Renders a resources section showing categorized tools with icons, descriptions, and external links. Uses cards and mapped category data to display resource lists.",
  "frontend/src/components/sections/VideoLessonsSection.tsx": "Displays a video lessons section using platform-specific icons and colors, mapping video lesson data into cards with watch buttons or placeholders. Includes helper functions for platform styling and opening video links.",
  "frontend/src/components/SiteSearch.tsx": "Provides a searchable input with keyboard navigation, live results, and result selection handling.",
  "frontend/src/config/cashAppLinks.ts": "Exports the configured Cash App payment URL. Used for linking users directly to the payment page.",
  "frontend/src/config/paymentContactNote.ts": "Defines and exports the post-payment contact note configuration with message, contact link, and label. Includes a helper to check if the note is set.",
  "frontend/src/config/subscriptionLinks.ts": "Exports subscription payment URLs for monthly and annual plans, both pointing to the Cash App link.",
  "frontend/src/content/broadTopicGuidance.ts": "Provides structured guidance items for broad content topics with descriptions, keywords, tips, and optional disclaimers. Covers mental health, learning, and collaboration content.",
  "frontend/src/content/contentTypeGuidance.ts": "Defines guidance for various content types with descriptions, keywords, and tips, plus optional disclaimers. Includes categories like personal, wellness, and educational content.",
  "frontend/src/content/growthGuidance.ts": "Exports growth tips and checklists outlining social media strategy areas like profile optimization, content planning, engagement, and analytics. Each item includes structured points or checklist items.",
  "frontend/src/content/siteContent.ts": "Defines interfaces and static platform tips and FAQs for search indexing and content display.",
  "frontend/src/content/videoLessons.ts": "Provides video lesson metadata including IDs, descriptions, platforms, tags, and optional URLs.",
  "frontend/src/hooks/useActor.ts": "Creates and manages a backend actor based on Internet Identity, auto‑refreshing queries when identity changes.",
  "frontend/src/hooks/useInternetIdentity.ts": "Implements an Internet Identity provider and hook for authentication state, login, logout, and identity loading.",
  "frontend/src/hooks/usePaymentClickCounts.ts": "Tracks and records payment button click counts via backend actor using React Query.",
  "frontend/src/hooks/usePwaInstall.ts": "Handles PWA install prompt events, exposing installability and installation state.",
  "frontend/src/hooks/useQueries.ts": "Placeholder hook exposing the backend actor for future queries.",
  "frontend/src/index.css": "Contains Tailwind CSS setup, color themes, typography, utilities, and UI animations.",
  "frontend/src/main.tsx": "Bootstraps the React app with QueryClient and InternetIdentityProvider.",
  "frontend/src/pwa/registerServiceWorker.ts": "Registers the service worker on page load with basic logging.",
  "frontend/src/search/scrollAndHighlight.ts": "Provides smooth scrolling to an element and temporary highlight animation for search results.",
  "frontend/src/search/searchIndex.ts": "Builds a unified search index from multiple content sources and provides tokenizing/normalization utilities for querying.",
  "frontend/tailwind.config.js": "Configures Tailwind theme, colors, fonts, container settings, shadows, and plugins for the frontend.",
  "project_state.json": "Tracks project metadata, architecture notes, monetization decisions, and existing feature requirements for Boostly."
}