{
  "backend/main.mo": "Implements click tracking with a map storing per-button click counts and exposes methods to record clicks and query counts.",
  "backend/migration.mo": "Defines a migration that initializes a new actor state containing an empty clickCounts map.",
  "feature_evidence.json": "Lists feature evidence entries mapping new payment-related features to affected frontend files, components, and test IDs.",
  "frontend-file-summaries.txt": "Contains prewritten summaries of many frontend files describing their purpose, content structures, and UI behavior.",
  "frontend/index.css": "Defines Tailwind base styles and extensive CSS variables for light and dark themes.",
  "frontend/index.html": "HTML entry point configuring meta tags, PWA manifest, icons, and loads the main React app.",
  "frontend/public/manifest.webmanifest": "PWA manifest defining app metadata, icons, theme colors, and startup behavior.",
  "frontend/public/offline.html": "Standalone offline fallback page with styling, a retry button, and auto-reconnect logic.",
  "frontend/public/sw.js": "Service worker implementing precaching, cache cleanup, navigation fallback, and cache-first fetch handling.",
  "frontend/src/App.tsx": "Main React component wiring navigation, sections, search index, and service worker registration into the site layout.",
  "frontend/src/components/BoostlyLink.tsx": "Displays the site’s current URL in a read‑only input with a button to copy it using the clipboard API.",
  "frontend/src/components/Footer.tsx": "Renders a multi-column footer with branding, resource links, social icons, and a copyright notice.",
  "frontend/src/components/HeroSection.tsx": "Hero section with headline, CTA buttons, a preview image, and an embedded BoostlyLink component.",
  "frontend/src/components/Layout.tsx": "Minimal layout component that wraps children in a full-height flex container.",
  "frontend/src/components/MarketingNav.tsx": "Responsive navigation bar with search, desktop links, and a mobile sheet menu that triggers section navigation.",
  "frontend/src/components/sections/BroadTopicGuidanceSection.tsx": "Section displaying guidance cards for broad content topics with icons, tips, and optional disclaimers.",
  "frontend/src/components/sections/ContentTypeGuidanceSection.tsx": "Section listing content-type guidance cards with descriptions, numbered tips, and optional disclaimers.",
  "frontend/src/components/sections/CoreGrowthTipsSection.tsx": "Renders growth tip cards and actionable checklists using content arrays, with icons and UI components. Provides structured sections for strategies and checklists.",
  "frontend/src/components/sections/FaqSection.tsx": "Displays FAQ items in an accordion layout sourced from site content. Provides collapsible question‑and‑answer entries.",
  "frontend/src/components/sections/GetBoostlyAppSection.tsx": "Handles PWA install prompt logic and shows installation status plus platform-specific instructions. Includes cards for install actions and guidance for iOS and other platforms.",
  "frontend/src/components/sections/PaymentMonetizationSection.tsx": "Shows monetization options for Apple Pay and Cash App with click tracking. Displays cards, click counts, and external payment link buttons.",
  "frontend/src/components/sections/PlatformTipsSection.tsx": "Renders platform-specific growth tips in tabbed cards using dynamic icons and content. Each tab shows tips for a social platform.",
  "frontend/src/components/sections/ToolsResourcesSection.tsx": "Lists categorized tools and resources with icons and links. Provides cards for planning, design, analytics, and checklist resources.",
  "frontend/src/components/SiteSearch.tsx": "Search bar with live filtering, keyboard navigation, and clickable results tied to the provided search index.",
  "frontend/src/content/broadTopicGuidance.ts": "Defines a guidance item type and provides topic-based content guidance with tips and keywords for mental health, learning, and collaboration.",
  "frontend/src/content/contentTypeGuidance.ts": "Defines a content-type guidance structure and includes tips, keywords, and optional disclaimers for various content styles.",
  "frontend/src/content/growthGuidance.ts": "Provides growth tips and checklists covering profile optimization, content strategy, consistency, engagement, hashtags, analytics, and collaboration.",
  "frontend/src/content/siteContent.ts": "Centralizes platform-specific tips and FAQs for social media growth and safe content creation across major platforms.",
  "frontend/src/hooks/useActor.ts": "React hook that creates and manages an authenticated or anonymous backend actor and refreshes dependent queries when identity changes.",
  "frontend/src/hooks/useInternetIdentity.ts": "Implements an Internet Identity context and provider for authentication management, including login, logout, and identity persistence.",
  "frontend/src/hooks/usePaymentClickCounts.ts": "Hook for fetching, tracking, and updating payment button click counts using the backend actor and React Query.",
  "frontend/src/hooks/usePwaInstall.ts": "Manages PWA installability state and exposes an install function using the beforeinstallprompt event.",
  "frontend/src/hooks/useQueries.ts": "Provides a placeholder hook returning actor and loading state for future backend queries.",
  "frontend/src/index.css": "Defines Tailwind base styles, theme variables, dark mode values, typography rules, and custom utilities.",
  "frontend/src/main.tsx": "Bootstraps the React app with React Query and Internet Identity providers.",
  "frontend/src/pwa/registerServiceWorker.ts": "Registers the service worker on window load and logs registration status.",
  "frontend/src/search/scrollAndHighlight.ts": "Scrolls smoothly to an element and applies a temporary highlight and focus effect.",
  "frontend/src/search/searchIndex.ts": "Builds a unified search index from multiple content sources and provides token-based relevance scoring.",
  "frontend/tailwind.config.js": "Configures Tailwind with custom colors, typography, container settings, animations, and extended theme options.",
  "project_state.json": "Describes the project state, features, goals, and architectural notes for the Boostly app."
}