{
  "kind": "build_request",
  "title": "Add an official installable Boostly app experience accessible from the website (PWA)",
  "priority": "normal",
  "requirements": [
    {
      "id": "REQ-23",
      "text": "Add an installable Progressive Web App (PWA) configuration for Boostly so the website can be installed as an “official app” on mobile and desktop (home screen / app launcher), including a web app manifest, app icons, and required meta tags.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-4"
        ],
        "quotes": [
          "Make an official app for my website boostly u can get to from the website"
        ]
      },
      "acceptanceCriteria": [
        "A valid web app manifest is present and linked from the HTML entry point.",
        "The PWA has a standalone display mode and uses the name “Boostly” in the manifest.",
        "App icons are provided and referenced by the manifest.",
        "The HTML entry point includes required PWA meta/link tags (manifest link, theme color, and Apple touch icon support).",
        "User-facing text remains in English."
      ]
    },
    {
      "id": "REQ-24",
      "text": "Implement offline-friendly app shell caching so the installed Boostly app loads reliably with a basic offline experience (cache the main HTML/CSS/JS bundle and static generated assets).",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-4"
        ],
        "quotes": [
          "Make an official app for my website boostly u can get to from the website"
        ]
      },
      "acceptanceCriteria": [
        "After at least one successful load, revisiting the site without a network connection loads an offline-capable app shell instead of a browser network error.",
        "The caching approach does not require any backend changes and does not route assets through the backend.",
        "The existing single-page navigation and on-page search still work normally when online."
      ]
    },
    {
      "id": "REQ-25",
      "text": "Add a visible “Get the Boostly App” entry point on the website that lets users access installation instructions and installation actions (where supported) from within the existing page navigation patterns.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-4"
        ],
        "quotes": [
          "Make an official app for my website boostly u can get to from the website"
        ]
      },
      "acceptanceCriteria": [
        "A new on-page section (e.g., “Get the Boostly App”) is reachable via a navigation item in both desktop and mobile navigation.",
        "The section includes concise English instructions for installing on iOS (Safari) and Android (Chrome) and desktop (Chrome/Edge) using built-in browser install flows.",
        "Where the browser supports it, an install button is shown that triggers the install prompt; when unsupported, the UI gracefully falls back to instructions.",
        "The new section uses stable element IDs so it can be scrolled to consistently from navigation."
      ]
    },
    {
      "id": "REQ-26",
      "text": "Add a prominent call-to-action on the landing/hero area that links to the new “Get the Boostly App” section without breaking existing “Get Started / View Tips” behavior.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-4"
        ],
        "quotes": [
          "Make an official app for my website boostly u can get to from the website"
        ]
      },
      "acceptanceCriteria": [
        "The hero area includes an additional CTA in English (e.g., “Get the App”) that scrolls to the new app section.",
        "Existing CTAs continue to scroll to the existing tips section as they do today.",
        "The hero layout remains responsive and accessible (keyboard focusable CTA, visible focus style)."
      ]
    }
  ],
  "constraints": [
    "Frontend files under frontend/src/hooks/useInternetIdentity.ts, frontend/src/hooks/useInternetIdentity.tsx, frontend/src/hooks/useActor.ts, frontend/src/main.tsx, frontend/src/components/ui must not be edited; compose new behavior around them.",
    "Backend must remain a single Motoko actor; no new backend services or external databases.",
    "Use English for any user-facing text."
  ],
  "nonGoals": [
    "Building a native iOS/Android app for the App Store / Google Play.",
    "Implementing push notifications, real-time messaging, or any third-party authentication beyond Internet Identity.",
    "Adding new backend features or persistent user accounts for this request."
  ],
  "imageRequirements": {
    "required": [
      "Boostly app icon (boostly-app-icon.dim_512x512.png)",
      "Boostly app icon (boostly-app-icon.dim_192x192.png)",
      "Boostly Apple touch icon (boostly-apple-touch-icon.dim_180x180.png)",
      "Boostly favicon (boostly-favicon.dim_32x32.png)"
    ],
    "edits": []
  }
}