{
  "kind": "implementation_plan",
  "version": "1.0",
  "title": "Cash App-only outbound payment link configuration and UI copy updates",
  "requirements": [
    {
      "id": "REQ-35",
      "summary": "Introduce a single, configurable Cash App payment URL and ensure all payments copy clearly states Boostly only links out (no payment collection/storage) while routing visitors to the owner’s Cash App payment page.",
      "acceptanceCriteria": [
        "A configurable Cash App payment URL exists in the frontend codebase (similar in spirit to frontend/src/config/subscriptionLinks.ts).",
        "The Cash App button opens the configured Cash App payment URL in a new tab with noopener/noreferrer, instead of opening https://cash.app/.",
        "All user-facing copy in the payments section clearly communicates that Boostly only links out and does not process, collect, or store payments.",
        "No user-facing text mentions routing money into a personal account within Boostly."
      ],
      "file_operations": [
        {
          "path": "frontend/src/config/cashAppLinks.ts",
          "operation": "create",
          "description": "Create a small config module (similar to subscriptionLinks) exporting a single source of truth for the owner’s Cash App payment destination URL (e.g., a $Cashtag or Cash App payment link), with a clear comment that Boostly only links out and does not process/store payments."
        },
        {
          "path": "frontend/src/components/sections/PaymentMonetizationSection.tsx",
          "operation": "modify",
          "description": "Update the Cash App CTA to read the destination from the new config and open it in a new tab using the existing window.open behavior (noopener/noreferrer). Replace any generic https://cash.app/ usage and ensure all user-facing payments copy is English and explicitly states payments are completed on Cash App and Boostly does not process/collect/store payments."
        }
      ]
    },
    {
      "id": "REQ-36",
      "summary": "Adjust the Payments/Monetization section to prioritize a Cash App-only flow with Cash App as the primary CTA and a clear setup state when the link is not configured.",
      "acceptanceCriteria": [
        "The Payments/Monetization section headline and supporting copy are updated to focus on Cash App as the payment destination.",
        "The primary CTA in the Payments/Monetization section is the Cash App button.",
        "If the Cash App URL is not configured, the Cash App button is disabled and an English setup/help message is shown (consistent with the existing subscription ‘link not set up’ pattern)."
      ],
      "file_operations": [
        {
          "path": "frontend/src/components/sections/PaymentMonetizationSection.tsx",
          "operation": "modify",
          "description": "Refactor the section UI and copy to emphasize Cash App as the payment destination (Cash App-only messaging), making the Cash App button the primary CTA. Add a configured/not-configured state (similar to SubscriptionPricingSection’s ‘Link Not Set Up’ pattern): disable the Cash App button when the configured URL is empty/missing and show an English setup/help Alert that points maintainers to frontend/src/config/cashAppLinks.ts."
        }
      ]
    },
    {
      "id": "REQ-37",
      "summary": "Update the payment-related FAQ to match the Cash App-only outbound payment flow and clarify Boostly does not process/store payments.",
      "acceptanceCriteria": [
        "frontend/src/content/siteContent.ts FAQ content is updated so the payment-related FAQ answer states visitors are taken to Cash App to pay and Boostly does not process/store payments.",
        "All updated FAQ text is in English and matches the Cash App-only flow used in the Payments/Monetization section."
      ],
      "file_operations": [
        {
          "path": "frontend/src/content/siteContent.ts",
          "operation": "modify",
          "description": "Update the existing payment FAQ entry (currently referencing Apple Pay & Cash App) to Cash App-only language, explicitly stating that clicking the button takes visitors to Cash App to complete payment and Boostly does not process, collect, or store payments."
        }
      ]
    }
  ]
}