{
  "kind": "implementation_plan",
  "version": "1.0",
  "title": "Boostly PWA: installable app + offline app shell + install section",
  "requirements": [
    {
      "id": "REQ-23",
      "summary": "Add PWA manifest, icons, and required meta/link tags so Boostly is installable as an official app",
      "acceptanceCriteria": [
        "A valid web app manifest is present and linked from the HTML entry point.",
        "The PWA has a standalone display mode and uses the name “Boostly” in the manifest.",
        "App icons are provided and referenced by the manifest.",
        "The HTML entry point includes required PWA meta/link tags (manifest link, theme color, and Apple touch icon support).",
        "User-facing text remains in English."
      ],
      "file_operations": [
        {
          "path": "frontend/index.html",
          "operation": "modify",
          "description": "Add PWA-required meta/link tags: manifest link, theme-color, Apple mobile web app tags, Apple touch icon link, and favicon link; keep all user-facing text in English."
        },
        {
          "path": "frontend/public/manifest.webmanifest",
          "operation": "create",
          "description": "Create a valid web app manifest for “Boostly” with standalone display mode, start_url/scope, theme/background colors, and icon references for 192x192 and 512x512 in frontend/public/assets/generated/."
        },
        {
          "path": "frontend/public/assets/generated/boostly-app-icon.dim_512x512.png",
          "operation": "create",
          "description": "Add generated PWA app icon asset at frontend/public/assets/generated/boostly-app-icon.dim_512x512.png and reference it from the manifest."
        },
        {
          "path": "frontend/public/assets/generated/boostly-app-icon.dim_192x192.png",
          "operation": "create",
          "description": "Add generated PWA app icon asset at frontend/public/assets/generated/boostly-app-icon.dim_192x192.png and reference it from the manifest."
        },
        {
          "path": "frontend/public/assets/generated/boostly-apple-touch-icon.dim_180x180.png",
          "operation": "create",
          "description": "Add generated Apple touch icon asset at frontend/public/assets/generated/boostly-apple-touch-icon.dim_180x180.png and reference it from frontend/index.html."
        },
        {
          "path": "frontend/public/assets/generated/boostly-favicon.dim_32x32.png",
          "operation": "create",
          "description": "Add generated favicon asset at frontend/public/assets/generated/boostly-favicon.dim_32x32.png and reference it from frontend/index.html."
        }
      ]
    },
    {
      "id": "REQ-24",
      "summary": "Implement offline-friendly app shell caching via a service worker (no backend changes)",
      "acceptanceCriteria": [
        "After at least one successful load, revisiting the site without a network connection loads an offline-capable app shell instead of a browser network error.",
        "The caching approach does not require any backend changes and does not route assets through the backend.",
        "The existing single-page navigation and on-page search still work normally when online."
      ],
      "file_operations": [
        {
          "path": "frontend/public/sw.js",
          "operation": "create",
          "description": "Add a service worker that precaches the app shell (HTML/CSS/JS) and static generated assets, including frontend/public/assets/generated/social-growth-hero.dim_1600x900.png and the required PWA icon files, and serves cached navigation responses when offline."
        },
        {
          "path": "frontend/public/offline.html",
          "operation": "create",
          "description": "Create a minimal offline fallback page (English) that the service worker can return if needed; ensure it does not introduce new navigation patterns."
        },
        {
          "path": "frontend/src/pwa/registerServiceWorker.ts",
          "operation": "create",
          "description": "Create a small helper to register the service worker from the React app (no changes to restricted files)."
        },
        {
          "path": "frontend/src/App.tsx",
          "operation": "modify",
          "description": "Wire service worker registration into the existing app lifecycle (e.g., on first client render) without editing restricted hooks/files; ensure SPA navigation and search remain unchanged when online."
        }
      ]
    },
    {
      "id": "REQ-25",
      "summary": "Add a “Get the Boostly App” navigation entry and an on-page section with install instructions and install actions (when supported)",
      "acceptanceCriteria": [
        "A new on-page section (e.g., “Get the Boostly App”) is reachable via a navigation item in both desktop and mobile navigation.",
        "The section includes concise English instructions for installing on iOS (Safari) and Android (Chrome) and desktop (Chrome/Edge) using built-in browser install flows.",
        "Where the browser supports it, an install button is shown that triggers the install prompt; when unsupported, the UI gracefully falls back to instructions.",
        "The new section uses stable element IDs so it can be scrolled to consistently from navigation."
      ],
      "file_operations": [
        {
          "path": "frontend/src/components/sections/GetBoostlyAppSection.tsx",
          "operation": "create",
          "description": "Create a new on-page section component with a stable section id (e.g., \"get-app\"), concise English install instructions for iOS/Android/Desktop, and an install button area. Use shadcn-ui components (e.g., Button/Card/Badge as appropriate) to match the site styling. Verify the component's usage instructions before implementing."
        },
        {
          "path": "frontend/src/hooks/usePwaInstall.ts",
          "operation": "create",
          "description": "Add a hook to capture the browser install prompt (beforeinstallprompt) and expose install-availability state plus a function to trigger the prompt; ensure graceful fallback when unsupported."
        },
        {
          "path": "frontend/src/components/MarketingNav.tsx",
          "operation": "modify",
          "description": "Add a new navigation item labeled “Get the Boostly App” to both desktop and mobile nav, following existing navigation patterns, and extend the onNavigate section union to include the new section."
        },
        {
          "path": "frontend/src/App.tsx",
          "operation": "modify",
          "description": "Wire the new GetBoostlyAppSection into the page flow and scrolling navigation by adding a ref, including it in the refs map, and rendering the section in a logical position with consistent spacing; ensure the section id remains stable for scroll targeting."
        }
      ]
    },
    {
      "id": "REQ-26",
      "summary": "Add a prominent hero CTA that scrolls to the new “Get the Boostly App” section without changing existing CTAs",
      "acceptanceCriteria": [
        "The hero area includes an additional CTA in English (e.g., “Get the App”) that scrolls to the new app section.",
        "Existing CTAs continue to scroll to the existing tips section as they do today.",
        "The hero layout remains responsive and accessible (keyboard focusable CTA, visible focus style)."
      ],
      "file_operations": [
        {
          "path": "frontend/src/components/HeroSection.tsx",
          "operation": "modify",
          "description": "Add an additional prominent CTA (English) such as “Get the App” that triggers a new callback; preserve existing “Get Started” and “View Tips” behavior and keep the layout responsive and accessible (focusable, visible focus style). Use existing shadcn-ui Button styles already in use. Verify the component's usage instructions before implementing."
        },
        {
          "path": "frontend/src/App.tsx",
          "operation": "modify",
          "description": "Provide HeroSection with a new callback that scrolls to the “Get the Boostly App” section while keeping the existing onGetStarted behavior unchanged."
        }
      ]
    }
  ]
}