{
  "kind": "implementation_plan",
  "version": "1.0",
  "title": "Configure real outbound subscription checkout links for Monthly and Annual CTAs",
  "requirements": [
    {
      "id": "REQ-34",
      "summary": "Replace placeholder subscription link config with real https checkout URLs and ensure the Subscribe CTA opens the correct outbound link in a new tab while preserving click tracking.",
      "acceptanceCriteria": [
        "In frontend/src/config/subscriptionLinks.ts, subscriptionLinks.monthly is set to a non-empty, valid https URL for the Monthly ($6.00) checkout page.",
        "In frontend/src/config/subscriptionLinks.ts, subscriptionLinks.annual is set to a non-empty, valid https URL for the Annual ($15.99) checkout page.",
        "When a visitor selects Monthly and clicks the Subscribe button, the site opens the configured Monthly checkout URL in a new tab.",
        "When a visitor selects Annual and clicks the Subscribe button, the site opens the configured Annual checkout URL in a new tab.",
        "Click tracking continues to record clicks for 'subscription-monthly' and 'subscription-annual' before opening the outbound link.",
        "No user-facing text is changed away from English."
      ],
      "file_operations": [
        {
          "path": "frontend/src/config/subscriptionLinks.ts",
          "operation": "modify",
          "description": "Set subscriptionLinks.monthly and subscriptionLinks.annual to the provided real, non-empty https checkout URLs for the Monthly ($6.00) and Annual ($15.99) plans (replace the current empty-string placeholders)."
        },
        {
          "path": "frontend/src/components/sections/SubscriptionPricingSection.tsx",
          "operation": "modify",
          "description": "Harden the subscribe click handler to only open configured valid https URLs in a new tab (noopener/noreferrer) and to preserve the existing click-tracking call order (record 'subscription-monthly' / 'subscription-annual' then open the outbound link), without changing any user-facing English text and without modifying any files under frontend/src/components/ui."
        }
      ]
    }
  ]
}